def INF():
    print('------------------------------------------------------------------------------------------------------------')
    skils_2 = ['Плохая растяжка', 'Медленно учит постановки', 'Никогда раньше не танцевал']
    skils_1 = ['Хорошая растяжка', 'Быстро учит постановки', 'Имеет опыт в танцах']
    x = 1
    list1 = ['Игнат', 'Диана', 'Кирилл', 'Лерок']
    print('Команда ЛУЧШИХ тренеров Сириуса:')
    print('-' * 108)
    for i in list1:
        print(str(x) + ')', i)
        x +=1
    print('-' * 108)
    infor = input('Чтобы узнать побробную информацию выберете порядковый номер человека - ')
    if '1' in infor:
        print('-' * 108)
        print(list1[0], '- Балетмейстер')
        print('-' * 108)
        print('+', skils_1[0])
        print('+', skils_1[1])
        print('+', skils_1[2])
    if '2' in infor:
        print('-' * 108)
        print(list1[1], '- Стилист всея Сириуса!')
        print('-' * 108)
        print('-', skils_2[0])
        print('-', skils_2[1])
        print('-', skils_2[2])
    if '3' in infor:
        print('-' * 108)
        print(list1[2], '- Лучший хореограф!')
        print('-' * 108)
        print('+', skils_1[0])
        print('+', skils_1[1])
        print('-' * 108)
        print('-', skils_2[2])
    if '4' in infor:
        print('-' * 108)
        print(list1[3], '- Даже не заметите, научитесь танцевать еще до занятий')
        print('-' * 108)
        print('+', skils_1[0])
        print('+', skils_1[1])
        print('+', skils_1[2])

