def Price():
    print('Категории товаров:')
    print('-Еда')
    print('-Обувь')
    print('-Одежда')
    print('-Аксуссуары')
    kateg = input('Выберите Категорию - ')
    print('------------------------------------------------------------------------------------------------------------')
    if 'еда' in kateg:
        eda()
    if 'обу' in kateg:
        obyv()
    if 'оде' in kateg:
        odega()
    if 'акс' in kateg:
        aks()


def eda():
    List = ['Вода- 55₽', 'Завтрак - 120₽', 'Обед - 190₽', 'Конфеты - 399₽ (КГ)']
    for i in List:
        print('-' + i)
    print('------------------------------------------------------------------------------------------------------------')
def obyv():
    List = ['Балетки - 1690₽', 'Кроссовки - 4900₽', 'Босиком - бесплатно']
    for i in List:
        print('-' + i)
    print('------------------------------------------------------------------------------------------------------------')
def odega():
    List = ['футболка - 2190₽', 'Лосины - 1990₽', 'Кофта - 2490₽', 'Костюм спротивный - 3200₽',]
    for i in List:
        print('-' + i)
    print('------------------------------------------------------------------------------------------------------------')


def aks():
    List = ['Станок - 30000тыс.', 'Ленты - 500₽', 'Блестки - 2100₽']
    for i in List:
        print('-' + i)
    print('------------------------------------------------------------------------------------------------------------')