import raspisanie
import prise
import info
list1 = ['Расписание Занятий', 'Магазин', 'Персонал']
# print('Наш сервис предлагает узнать следующие категории:')
# print('------------------------------------------------------------------------------------------------------------')
# for i in list1:
#     print('+', i)
# print('------------------------------------------------------------------------------------------------------------')
# vibor = input('Напишете название категории которая вас интересует - ')
# vibor = vibor.lower()

while True:
    print('-' * 108)
    print('Вы попали в танцевальный клуб Сись Аминь! тут вы можете увитеть следующее!')
    print(
        '------------------------------------------------------------------------------------------------------------')
    for i in list1:
        print('+', i)
    print(
        '------------------------------------------------------------------------------------------------------------')
    vibor = input('Напишете название категории которая вас интересует - ')
    vibor = vibor.lower()

    if 'сп' in vibor:
        raspisanie.Raspisanie()
    elif 'маг' in vibor:
        prise.Price()
    elif 'нф' in vibor:
        info.INF()
    else:
        print('Я ваш Английский не понимать (переформулируйте запрос)')
    input('введите enter чтобы продолжить')
